Revit 2026 API

# TransformCreateTranslation Method

---

Creates a transform that represents a translation via the specified vector.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static Transform CreateTranslation(
	XYZ vector
)
```
```vb
Public Shared Function CreateTranslation (
	vector As XYZ
) As Transform
```
```cpp
public:
static Transform^ CreateTranslation(
	XYZ^ vector
)
```
```fsharp
static member CreateTranslation :
        vector : XYZ -> Transform
```

#### Parameters

vector XYZ
     The translation vector.

#### Return Value

Transform The new transform.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was NULL |

#### Reference

Transform Class

Autodesk.Revit.DB Namespace